import React, {useState, useEffect} from 'react';

import song from "./audio/verse2.mp3";

import Commentary_1 from "./Commentary_1";

function MyAudio() {
  
  const [audio] = useState (new Audio(song));
  const [isPlaying, setPlaying] = useState (false);
  const [isShow,setShow] = useState (false);

  const playPause = () => setPlaying(!isPlaying);

  const handleClick = evt =>{
    setShow(!isShow);
  };

  useEffect(() => {
    isPlaying? audio.play(): audio.pause();
    }
  );
  return (
      <div>    
        {isPlaying ? "Song is Playing" : "Song is Paused"}
        <button onClick={playPause}>Play | Pause</button>

        <button onClick={handleClick}>Toggle</button>
      
        {isShow ?
        
          <Commentary_1 text="युष्मदस्मत्प्रत्ययगोचरयोर्विषयविषयिणोस्तमःप्रकाशवद्विरुद्धस्वभावयोरितरेतरभावानुपपत्तौ सिद्धायाम् , तद्धर्माणामपि सुतरामितरेतरभावानुपपत्तिः — इत्यतः अस्मत्प्रत्ययगोचरे विषयिणि चिदात्मके युष्मत्प्रत्ययगोचरस्य विषयस्य तद्धर्माणां चाध्यासः तद्विपर्ययेण विषयिणस्तद्धर्माणां च विषयेऽध्यासो मिथ्येति भवितुं युक्तम् । तथाप्यन्योन्यस्मिन्नन्योन्यात्मकतामन्योन्यधर्मांश्चाध्यस्येतरेतराविवेकेन अत्यन्तविविक्तयोर्धर्मधर्मिणोः मिथ्याज्ञाननिमित्तः सत्यानृते मिथुनीकृत्य ‘अहमिदम्’ ‘ममेदम्’ इति नैसर्गिकोऽयं लोकव्यवहारः ॥
    आह — कोऽयमध्यासो नामेति । उच्यते — स्मृतिरूपः परत्र पूर्वदृष्टावभासः । तं केचित् अन्यत्रान्यधर्माध्यास इति वदन्ति । केचित्तु यत्र यदध्यासः तद्विवेकाग्रहनिबन्धनो भ्रम इति । अन्ये तु यत्र यदध्यासः तस्यैव विपरीतधर्मत्वकल्पनामाचक्षते । सर्वथापि तु अन्यस्यान्यधर्मावभासतां न व्यभिचरति । तथा च लोकेऽनुभवः — शुक्तिका हि रजतवदवभासते, एकश्चन्द्रः सद्वितीयवदिति ॥
    कथं पुनः प्रत्यगात्मन्यविषये अध्यासो विषयतद्धर्माणाम् ? सर्वो हि पुरोऽवस्थित एव विषये विषयान्तरमध्यस्यति ; युष्मत्प्रत्ययापेतस्य च प्रत्यगात्मनः अविषयत्वं ब्रवीषि । उच्यते — न तावदयमेकान्तेनाविषयः, अस्मत्प्रत्ययविषयत्वात् अपरोक्षत्वाच्च प्रत्यगात्मप्रसिद्धेः ; न चायमस्ति नियमः — पुरोऽवस्थित एव विषये विषयान्तरमध्यसितव्यमिति ; अप्रत्यक्षेऽपि ह्याकाशे बालाः तलमलिनतादि अध्यस्यन्ति ; एवमविरुद्धः प्रत्यगात्मन्यपि अनात्माध्यासः ॥"/>
    :
          <></>
        }
      </div>
    );
};

export default MyAudio;
